"""
create date: 2026/04/23
author: ikuta
content: main_2U
"""

#------------------------------------------------------
# import  
import src.sat_2U.main_HK_2U as HK_2U

#------------------------------------------------------
# main

def analysis_2U(extracted_list):

    for item in extracted_list: # ファイル名による条件分岐
    #-----------------------------------------------------------------------------------
    # HKデータ解析
        # HKという文字がファイル名に入っているものをここで処理
        if "HK" in item["name"]:
            HK_2U.analysis_HK_2U(item)
    #----------------------------------------------------------------------------------
