"""
create date: 2026/04/23
author: ikuta
content: main_1U
"""

#------------------------------------------------------
# import  
import src.sat_1U.main_HK_1U as HK_1U

#------------------------------------------------------
# main

def analysis_1U(extracted_list):
    
    for item in extracted_list: # ファイル名による条件分岐
    #-----------------------------------------------------------------------------------
    # HKデータ解析
        # HKという文字がファイル名に入っているものをここで処理
        if "HK" in item["name"]:
            HK_1U.analysis_HK_1U(item)
    #-----------------------------------------------------------------------------------
